{
  "locale": "en",
  "gradeColor": "White",
  "number": 6,
  "principles": [
    {
      "name": "Grade 6 White",
      "id": "white-grade",
      "sectionWhy": "",
      "description": "<p>The circle closes itself with the white grade. It incorporates all principles and practices of the colorful grades. A developer who reaches the white grade works permanently with all faces of the&nbsp;<a href=\"https://ccd_school.gitbooks.io/clean-code-developer-com/content/02grades/11_White_Grade.html#values\">value system</a>. Such a universal focus is hard to keep. So after a while a CCD should again start from the beginning.</p><p>Restarting the&nbsp;<a href=\"https://ccd_school.gitbooks.io/clean-code-developer-com/content/02grades/11_White_Grade.html#grade-1-red\">red grade</a>&nbsp;after 21 days you can better focus just on a section of the value system. This helps to refine your practice with details of the specific grades. Sample: The practice “version control” is not linear. Introducing it in read grade doesn’t drive it to the limit. Coming back from white grade to red grade allows yourself to dive deeper into version control. There is not principle and no practices which would not benefit from being inspected in repeated iterations of the grades.</p><p>Returning from white grade to red grade also expresses the general understanding that iterations also are a basic pattern for learning. Learning happens in loops and requires repetition.</p><p>Additionally removing the white bracelet is an act of modesty and restraint. Though this sounds unnecessarily esoteric it shall merely make obvious that software development is eternal learning. It is an illusion to think there would be a final line. If you let white being followed by red, you will be aware of that learning-circle.</p><p>If you do not like this, repeat the colorful grades in random order. Focus for a certain time on the aspects of any grade. Restarting at red grade simply ensures that all aspects are deepened.</p>",
      "gradeRating": {
        "evolvability": "_0",
        "correctness": "_0",
        "productionEfficiency": "_0",
        "continuousImprovement": "_0",
        "responsibility": "SingleDev"
      },
      "sources": []
    }
  ],
  "practices": []
}